{"source_file": "C:\\Users\\rohit\\OneDrive\\Desktop\\MINI\\MINI-PROJECT\\data\\mk0.csv", "chunk_index": 0, "text": "row : 1 | text : req - 001 odd the system shall provide lane keeping assistance only when the road surface classification equals'paved'based on camera image analysis. row : 2 | text : req - 002 odd the system shall enable lane keeping assistance only when at least one lane marking has a detection confidence ≥ 0. 75 on a 0 – 1 scale. row : 3 | text : req - 003 odd the system shall allow activation of lane keeping assistance only when vehicle speed is ≥ 60 km / h. row : 4 | text : req - 004 odd the system shall allow activation of lane keeping assistance only when vehicle speed is ≤ 190 km / h. row : 5 | text : req - 005 odd the system shall deactivate lane keeping assistance when vehicle speed remains below 55 km / h for more than 2. 0 seconds. row : 6 | text : req - 006 odd the system shall transition to ldw - only mode if lane marking confidence remains below 0. 50 for more than 1. 0 second. row : 7 | text : req - 007 hmi when deactivation occurs due to odd limits, the system shall display'lane keeping assist unavailable'for at least 4 seconds. row : 8 | text : req - 008 sensing the system shall sample camera - based lane detection at a minimum frequency of 30 hz. row : 9 | text : req - 009 sensing the system shall use steering angle sensor data with a minimum update rate of 100 hz. row : 10 | text : req - 010 sensing the system shall use yaw rate sensor data with a minimum update rate of 100 hz. row : 11 | text : req - 011 sensing the system shall not require gnss availability for lane keeping support. row : 12 | text : req - 012 activation the driver shall activate or deactivate lka using the steering wheel lka button. row : 13 | text : req - 013 activation the system shall enter standby when lka is on, speed ≥ 60 km / h, and lane markings have confidence ≥ 0. 75. row : 14 | text : req - 014 activation the system shall activate steering assistance only after standby for at least 0. 5 seconds. row : 15 | text : req - 015 activation the system shall ramp in steering torque over a duration of 0. 3 – 0. 6 seconds to avoid abrupt steering. row : 16 | text :", "source_type": "csv", "location": null}
{"source_file": "C:\\Users\\rohit\\OneDrive\\Desktop\\MINI\\MINI-PROJECT\\data\\mk0.csv", "chunk_index": 1, "text": "for at least 0. 5 seconds. row : 15 | text : req - 015 activation the system shall ramp in steering torque over a duration of 0. 3 – 0. 6 seconds to avoid abrupt steering. row : 16 | text : req - 016 activation the system shall automatically deactivate lka when the driver presses the lka off button. row : 17 | text : req - 017 deactivation the system shall deactivate lka when the driver applies steering torque ≥ 5. 0 n · m for > 1. 0 second. row : 18 | text : req - 018 lane change the system shall suspend steering support when a turn indicator is active and lateral acceleration exceeds 0. 8 m / s². row : 19 | text : req - 019 lane change the system shall resume steering support within 1. 5 seconds after a lane change if lane markings are detected. row : 20 | text : req - 020 driver monitoring the system shall monitor steering wheel torque at a sampling rate of 100 hz. row : 21 | text : req - 021 driver monitoring the system shall detect hands - off driving when driver - applied torque < 1. 5 n · m for ≥ 7. 0 seconds. row : 22 | text : req - 022 driver monitoring the system shall issue a first - level hands - off warning within 0. 5 s after hands - off detection. row : 23 | text : req - 023 driver monitoring the first - level hands - off warning shall include a 75 ± 5 db chime and a visual message'place hands on steering '. row : 24 | text : req - 024 driver monitoring the system shall issue an escalated hands - off warning if hands - on torque ≥ 1. 5 n · m is not applied within 5. 0 seconds after first - level warning. row : 25 | text : req - 025 driver monitoring the escalated warning shall include repeated chimes at 2 hz and a flashing steering - wheel icon at 2 hz. row : 26 | text : req - 026 driver monitoring the system shall deactivate lka if no driver torque ≥ 1. 5 n · m is detected for 15 seconds after the escalated warning begins. row : 27 | text : req - 027 driver monitoring the system shall cancel warnings within 0. 5 seconds when driver torque ≥ 1. 5 n · m is detected. row : 28 | text : req - 028 performance the system shall maintain", "source_type": "csv", "location": null}
{"source_file": "C:\\Users\\rohit\\OneDrive\\Desktop\\MINI\\MINI-PROJECT\\data\\mk0.csv", "chunk_index": 2, "text": "27 | text : req - 027 driver monitoring the system shall cancel warnings within 0. 5 seconds when driver torque ≥ 1. 5 n · m is detected. row : 28 | text : req - 028 performance the system shall maintain lateral position error within ±0. 30 m from lane center at 130 km / h on straight roads under nominal conditions. row : 29 | text : req - 029 performance the system shall limit lateral acceleration to ≤ 2. 0 m / s² during cornering. row : 30 | text : req - 030 performance the system shall limit lateral jerk to ≤ 1. 0 m / s³ during steering corrections. row : 31 | text : req - 031 performance the system shall limit applied steering torque to ≤ 3. 0 n · m under normal lane centering operation. row : 32 | text : req - 032 performance the system shall initiate lane departure correction when predicted lateral offset reaches ≥ 0. 25 m from lane boundary within 1. 0 second. row : 33 | text : req - 033 performance the system shall differentiate solid, dashed, and road - edge markings and apply corrective torque only for solid and dashed lane lines. row : 34 | text : req - 034 occupancy the system shall read blind - spot occupancy inputs with a minimum update rate of 20 hz. row : 35 | text : req - 035 occupancy the system shall treat a lane as occupied if any connected sensor reports occupancy = true. row : 36 | text : req - 036 occupancy the system shall not apply steering torque that would cause the vehicle to cross into an occupied adjacent lane. row : 37 | text : req - 037 occupancy if occupancy data is unavailable for more than 0. 5 seconds, the system shall ignore occupancy constraints and continue lane - based control. row : 38 | text : req - 038 warning the ldw haptic warning shall vibrate the steering wheel at 120 – 160 hz for 0. 4 – 0. 6 seconds. row : 39 | text : req - 039 warning the system shall trigger ldw when predicted lane crossing time is ≤ 0. 8 seconds and driver torque < 1. 5 n · m. row : 40 | text : req - 040 warning ldw shall not activate when the corresponding turn indicator has been active for at least 0. 3 seconds. row", "source_type": "csv", "location": null}
{"source_file": "C:\\Users\\rohit\\OneDrive\\Desktop\\MINI\\MINI-PROJECT\\data\\mk0.csv", "chunk_index": 3, "text": "≤ 0. 8 seconds and driver torque < 1. 5 n · m. row : 40 | text : req - 040 warning ldw shall not activate when the corresponding turn indicator has been active for at least 0. 3 seconds. row : 41 | text : req - 041 faults the system shall deactivate lka within 0. 2 seconds when the camera reports a critical failure state. row : 42 | text : req - 042 faults the system shall display'lka malfunction'for at least 6 seconds when a critical fault is detected. row : 43 | text : req - 043 faults the system shall store a diagnostic trouble code ( dtc ) within 0. 1 seconds of detecting a camera or steering actuator fault. row : 44 | text : req - 044 faults the system shall inhibit steering support if the steering actuator reports torque tracking error > 1. 0 n · m for more than 0. 5 seconds. row : 45 | text : req - 045 faults the system shall record timestamped events for activation, deactivation, warnings, and faults with 1. 0 ms resolution. row : 46 | text : req - 046 regulations the system shall comply with unece r79 class c lane keeping functionality requirements. row : 47 | text : req - 047 regulations the system shall restrict user - configurable ldw sensitivity to two modes : standard and early. row : 48 | text : req - 048 vehicle config the system shall disable lka when trailer mode is active. row : 49 | text : req - 049 vehicle config the system shall disable lka when the tire diameter mismatch warning is active for more than 3 seconds. row : 50 | text : req - 050 documentation the system shall provide oem - approved descriptions, signal definitions, and state machine documentation suitable for ai system - knowledge training.", "source_type": "csv", "location": null}
